### Basics of Data Frame

In [3]:
# Pandas
import pandas as pd
import numpy as np

In [4]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['Column1','Column2','Column3','Column4'])

In [6]:
df.head()

      Column10  Column2  Column3  Column4
Row1         0        1        2        3
Row2         4        5        6        7
Row3         8        9       10       11
Row4        12       13       14       15
Row5        16       17       18       19

In [7]:
df.to_csv("Third day")

In [8]:
df.loc['Row1']

Column10    0
Column2     1
Column3     2
Column4     3
Name: Row1, dtype: int32

In [12]:
df.loc['Row3']

Column10     8
Column2      9
Column3     10
Column4     11
Name: Row3, dtype: int32

In [13]:
type(df.loc['Row1'])

pandas.core.series.Series

In [15]:
df.loc[['Row1','Row2']]

      Column10  Column2  Column3  Column4
Row1         0        1        2        3
Row2         4        5        6        7

In [16]:
df.iloc[:,:]

      Column10  Column2  Column3  Column4
Row1         0        1        2        3
Row2         4        5        6        7
Row3         8        9       10       11
Row4        12       13       14       15
Row5        16       17       18       19

In [17]:
df.iloc[1:2,2:3]

      Column3
Row2        6

In [18]:
type(df.iloc[1:2,2:3])

pandas.core.frame.DataFrame

In [21]:
df.iloc[0:3,0:2]

      Column10  Column2
Row1         0        1
Row2         4        5
Row3         8        9

In [22]:
#converting into a array
df.iloc[0:3,0:2].values

array([[0, 1],
       [4, 5],
       [8, 9]])

In [27]:
df['Column10'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column10, dtype: int64

In [25]:
df.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of       Column10  Column2  Column3  Column4
Row1     False    False    False    False
Row2     False    False    False    False
Row3     False    False    False    False
Row4     False    False    False    False
Row5     False    False    False    False>

In [26]:
df.isnull().sum()

Column10    0
Column2     0
Column3     0
Column4     0
dtype: int64

In [29]:
df['Column10'].unique()

array([ 0,  4,  8, 12, 16])

In [30]:
df['Column10'].nunique()

5

In [33]:
df[['Column3','Column2']]

      Column3  Column2
Row1        2        1
Row2        6        5
Row3       10        9
Row4       14       13
Row5       18       17

In [34]:
df.describe()

        Column10    Column2    Column3    Column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column10  5 non-null      int32
 1   Column2   5 non-null      int32
 2   Column3   5 non-null      int32
 3   Column4   5 non-null      int32
dtypes: int32(4)
memory usage: 292.0+ bytes

In [36]:
df1=pd.read_clipboard()

In [37]:
df1

,Name of School/ Department:,Unnamed: 1,Unnamed: 2,Unnamed: 3,Academic Session: Jan-June 2023,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Semester: IV
0,S.No.,Student Name,Parameters of Success Score,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Consolidated Score (Even-Odd Semesters) [100/S...
1,NaN,NaN,Global Competencies/ Technological Advancement...,Capacity Building/ Skill Enhancement ...,Higher Education/ Research ...,Sports/Community Clubs/Collegiate System ...,Entrepreneurship/ Innovative Practices/ Start ...,Industrial / Business Mentoring ...,Experimental/ Experiential Learning (10/ Sess...,Internship & Training (10/ Session),Brand Yourself/ Networking (10/ Session),Spiritual Studies for Mindfulness (10/ Session),NaN
2,1,ABHAY RAJ SHUKLA,4,5,5,8,4,7,6,5,5,7,56
3,6,ADITI KUMARI RAO,6,6,5,4,5,7,6,6,6,6,57
4,3,ADITYA KUMAR SINGH,5,6,5,6,5,7,6,2,2,7,51
...,...,...,...,...,...,...,...,...,...,...,...,...,...
60,59,RAUSHAN KUMAR JHA,3,5,6,3,5,7,6,3,7,6,51
61,60,RAVI RAUSHAN,4,4,4,4,4,7,2,4,5,6,44
62,61,VED PRAKASH,6,5,5,4,4,7,4,1,5,6,47
63,62,SAKSHAY,3,5,6,5,4,7,3,0,3,2,38
64,63,UVAIS KARNI,3,4,4,5,5,7,5,5,6,4,48

In [38]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65 entries, 0 to 64
Data columns (total 13 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   Name of School/ Department:      64 non-null     object
 1   Unnamed: 1                       64 non-null     object
 2   Unnamed: 2                       65 non-null     object
 3   Unnamed: 3                       64 non-null     object
 4   Academic Session: Jan-June 2023  64 non-null     object
 5   Unnamed: 5                       64 non-null     object
 6   Unnamed: 6                       64 non-null     object
 7   Unnamed: 7                       64 non-null     object
 8   Unnamed: 8                       64 non-null     object
 9   Unnamed: 9                       64 non-null     object
 10  Unnamed: 10                      64 non-null     object
 11  Unnamed: 11                      64 non-null     object
 12  Semester: IV                     64 non-null     object
dtypes: object(13)
memory usage: 6.7+ KB

In [39]:
df1.describe()

,Name of School/ Department:,Unnamed: 1,Unnamed: 2,Unnamed: 3,Academic Session: Jan-June 2023,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Semester: IV
count,64,64,65,64,64,64,64,64,64,64,64,64,64
unique,63,64,8,8,7,8,8,2,7,10,8,8,27
top,6,Student Name,6,5,5,6,5,7,6,6,6,6,54
freq,2,1,20,22,23,22,18,63,27,23,23,25,5

In [45]:
df1['Unnamed: 1']

0           Student Name
1                    NaN
2       ABHAY RAJ SHUKLA
3       ADITI KUMARI RAO
4     ADITYA KUMAR SINGH
             ...
60     RAUSHAN KUMAR JHA
61          RAVI RAUSHAN
62           VED PRAKASH
63               SAKSHAY
64           UVAIS KARNI
Name: Unnamed: 1, Length: 65, dtype: object

In [50]:
df1.corr()

Empty DataFrame
Columns: []
Index: []

In [52]:
#CSV
from io import StringIO, BytesIO

In [53]:
data=('Col1,Col2,Col3\n'
      'x,y,z\n'
      'a,b,c\n'
      'c,d,e')

In [54]:
print(data)

Col1,Col2,Col3
x,y,z
a,b,c
c,d,e

In [55]:
type(data)

str

In [57]:
pd.read_csv(StringIO(data))

  Col1 Col2 Col3
0    x    y    z
1    a    b    c
2    c    d    e

In [61]:
df2=pd.read_csv(StringIO(data),usecols=['Col1','Col3'])

In [62]:
df2

  Col1 Col3
0    x    z
1    a    c
2    c    e

In [63]:
df2.to_csv("Another.csv")

In [65]:
data=('a,b,c,d\n'
         '1,2,3,4\n'
         '5,6,7,8\n'
         '9,10,11,12')

In [66]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [69]:
df=pd.read_csv(StringIO(data),dtype=int)

In [70]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [71]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int32

In [72]:
df['a'][2]

9

In [73]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':object})

In [74]:
df.head()

   a     b   c   d
0  1   2.0   3   4
1  5   6.0   7   8
2  9  10.0  11  12

In [76]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int32

In [77]:
df['b']

0     2.0
1     6.0
2    10.0
Name: b, dtype: float64

In [78]:
df['c']

0     3
1     7
2    11
Name: c, dtype: object

In [79]:
df.dtypes

a      int32
b    float64
c     object
d      int64
dtype: object

In [80]:
data=('index,a,b,c\n'
         '5,apple,bat,4.5\n'
         '8,orange,ball,2.6')

In [81]:
data

'index,a,b,c\n5,apple,bat,4.5\n8,orange,ball,2.6'

In [83]:
df=pd.read_csv(StringIO(data))

In [84]:
df

   index       a     b    c
0      5   apple   bat  4.5
1      8  orange  ball  2.6

In [85]:
df=pd.read_csv(StringIO(data),index_col=0)

In [86]:
df

            a     b    c
index
5       apple   bat  4.5
8      orange  ball  2.6

In [87]:
df=pd.read_csv(StringIO(data),index_col=2)

In [88]:
df

      index       a    c
b
bat       5   apple  4.5
ball      8  orange  2.6

In [106]:
data1=('a,b,c\n'
         '5,apple,Bat\n'
         '8,orange,Cat')

In [107]:
df3=pd.read_csv(StringIO(data1))

In [108]:
df3

   a       b    c
0  5   apple  Bat
1  8  orange  Cat

In [109]:
df3=pd.read_csv(StringIO(data1),index_col=False)

In [110]:
df3

   a       b    c
0  5   apple  Bat
1  8  orange  Cat

In [111]:
df3=pd.read_csv(StringIO(data1),usecols=['a','c'],index_col=False)

In [112]:
df3

   a    c
0  5  Bat
1  8  Cat

In [116]:
data='a,b\n"Hello,\\"Sandy\\",Nice to see you",5'

In [117]:
df3=pd.read_csv(StringIO(data),escapechar='\\')

In [118]:
df3

                               a  b
0  Hello,"Sandy",Nice to see you  5

### Hope you Enjoy the Tutorial
### ~ Sandeep